/*Определить, сколько книг прочитал каждый читатель в текущем году. Вывести рейтинг читателей по убыванию.*/


/*Определить, сколько книг у читателей на руках на текущую дату.*/


/*Определить читателей, у которых на руках определенная книга.*/


/* Определите, какие книги на руках читателей.*/


/*Вывести количество должников на текущую дату. */


/*Книги какого издательства были самыми востребованными у читателей? Отсортируйте издательства по убыванию востребованности книг.*/


/*Определить самого издаваемого автора.*/


/*Определить среднее количество прочитанных страниц читателем за день.*/